app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computers 101"], ["room_number", 520], ["created_at", "2018-09-22 14:37:06.885443"], ["updated_at", "2018-09-22 14:37:06.885443"]]
---
  def create
    @class = SchoolClass.new(school_params(:title, :room_number))
    @class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @class = SchoolClass.find(params[:id])

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Computers 200"], ["room_number", 111], ["updated_at", "2018-09-22 14:44:19.530888"], ["id", 1]]
---
  def update
    @class = SchoolClass.update(school_params(:title, :room_number))